Revit 2024 API
Category.HasMaterialQuantities Property
 Identifies if elements of the category are able to report what materials they contain in what quantities.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool HasMaterialQuantities { get; }
Visual Basic
Public ReadOnly Property HasMaterialQuantities As Boolean
	Get
Visual C++
public:
property bool HasMaterialQuantities {
	bool get ();
}
Remarks
 Get materials via the Element' property Materials; Get quantities via methods GetMaterialArea and GetMaterialVolume.
See Also
Category Class
Autodesk.Revit.DB Namespace